renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_memdrv_rx/src/r_memdrv_qspi.c
    if (r_memdrv_dtc_enable(&dtc_info) != MEMDRV_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    dtc_info.drv            = MEMDRV_DRVR_RX_FIT_QSPI_SMSTR;
    dtc_info.src_adr        = reg_adr;
    dtc_info.dst_adr        = (uint32_t)p_memdrv_info->p_data;
    dtc_info.block_size     = 0;
    dtc_info.cnt            = p_memdrv_info->cnt;
    dtc_info.p_dtc_cfg      = &dtc_cfg;
    dtc_info.p_dtc_transfer = &g_memdrv_dtc_info[devno][MEMDRV_INDEX_DTC_RX];
    switch (channel)
    {
        case 0:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0)
            dtc_info.act_source = DTCE_QSPI_SPRI;
    #endif
        }
        break;
        case 1:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1)
            dtc_info.act_source = DTCE_QSPI1_SPRI1;
    #endif
        }
        break;
        case 2:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2)
            dtc_info.act_source = DTCE_QSPI2_SPRI2;
    #endif
        }
        break;
        default:
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return MEMDRV_ERR_OTHER;
        }
        break;
    }

    r_memdrv_dtc_set_rx(&dtc_info);

    if (r_memdrv_dtc_enable(&dtc_info) != MEMDRV_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#endif  /* (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC) */

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_qspi_enable_rx_data_dtc() */

/************************************************************************************************
* Function Name: r_memdrv_qspi_tx
* Description  : Transmits data for command and status register.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                       ;   Successful operation
*              : MEMDRV_ERR_HARD                      ;   Hardware error
*              : MEMDRV_ERR_OTHER                     ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_qspi_tx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    qspi_smstr_info_t     tx_info;
    qspi_smstr_status_t   ret_drv = QSPI_SMSTR_SUCCESS;
    uint8_t channel = r_memdrv_get_drv_ch(devno);

    tx_info.data_cnt  = p_memdrv_info->cnt;
    tx_info.p_tx_data = p_memdrv_info->p_data;
    tx_info.tran_mode = QSPI_SMSTR_SW;
    tx_info.op_mode   = QSPI_SMSTR_SINGLE_SPI_WRITE;

    ret_drv = R_QSPI_SMstr_Write(channel, &tx_info);
    if   (QSPI_SMSTR_SUCCESS == ret_drv)
    {
        return MEMDRV_SUCCESS;
    }
    else if (QSPI_SMSTR_ERR_HARD == ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_HARD;
    }
    else
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
} /* End of function r_memdrv_qspi_tx() */

/************************************************************************************************
* Function Name: r_memdrv_qspi_tx_data
* Description  : Transmits data using the single mode.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                       ;   Successful operation
*              : MEMDRV_ERR_HARD                      ;   Hardware error
*              : MEMDRV_ERR_OTHER                     ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
#if (MEMDRV_CFG_DEV0_TYPE == 1)  | (MEMDRV_CFG_DEV1_TYPE == 1)
memdrv_err_t r_memdrv_qspi_tx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    qspi_smstr_info_t     tx_info;
    qspi_smstr_status_t   ret_drv = QSPI_SMSTR_SUCCESS;
    uint8_t channel = r_memdrv_get_drv_ch(devno);

    tx_info.data_cnt  = p_memdrv_info->cnt;
    tx_info.p_tx_data = p_memdrv_info->p_data;

    /* Set transfer mode. */
    if (MEMDRV_ADDR_BOUNDARY & (uint32_t)p_memdrv_info->p_data)
    {
        /* If the buffer address is not 4 bytes alignment, force to perform the CPU transfer. */
        tx_info.tran_mode = QSPI_SMSTR_SW;
    }
    else if (MEMDRV_CHK_MULT_OF_16 & p_memdrv_info->cnt)
    {
        /* If the data counter is not multiple of 16, force to perform the CPU transfer. */
        tx_info.tran_mode = QSPI_SMSTR_SW;
    }
    else
    {
        tx_info.tran_mode = r_memdrv_qspi_set_tran_mode(devno);
    }

    switch (p_memdrv_info->io_mode)
    {
        case MEMDRV_MODE_SINGLE:
        {
            tx_info.op_mode = QSPI_SMSTR_SINGLE_SPI_WRITE;
        }
        break;
        case MEMDRV_MODE_DUAL:
        {
            tx_info.op_mode = QSPI_SMSTR_DUAL_SPI;
        }
        break;
        case MEMDRV_MODE_QUAD:
        {
            tx_info.op_mode = QSPI_SMSTR_QUAD_SPI;
        }
        break;
        default:
        break;
    }

