renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_memdrv_rx/src/r_memdrv_qspi.c
    ret_drv = R_QSPI_SMstr_Write(channel, &tx_info);
    if   (QSPI_SMSTR_SUCCESS == ret_drv)
    {
        return MEMDRV_SUCCESS;
    }
    else if (QSPI_SMSTR_ERR_HARD == ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_HARD;
    }
    else
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
} /* End of function r_memdrv_qspi_tx_data() */
#elif (MEMDRV_CFG_DEV0_TYPE == 0)  | (MEMDRV_CFG_DEV1_TYPE == 0)
memdrv_err_t r_memdrv_qspi_tx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    qspi_smstr_info_t           tx_info;
    qspi_smstr_status_t         ret_drv      = QSPI_SMSTR_SUCCESS;
    uint32_t                    boundary_cnt = 0;
    uint32_t                    txcnt = p_memdrv_info->cnt;
    uint8_t channel = r_memdrv_get_drv_ch(devno);

    tx_info.p_tx_data = p_memdrv_info->p_data;

    /* Check the 4 bytes address boundary.
       When the address is not 4 bytes address boundary,
       transfer the data of 1-3 bytes using software transfer. */
    if (0 != ((uint32_t)tx_info.p_tx_data & 0x00000003))
    {
        boundary_cnt      = (0x00000004 - ((uint32_t)tx_info.p_tx_data & 0x00000003));
        tx_info.data_cnt  = boundary_cnt;
        tx_info.tran_mode = QSPI_SMSTR_SW;
        if (MEMDRV_MODE_SINGLE == p_memdrv_info->io_mode)
        {
            tx_info.op_mode   = QSPI_SMSTR_SINGLE_SPI_WRITE;
        }
        else if (MEMDRV_MODE_DUAL == p_memdrv_info->io_mode)
        {
            tx_info.op_mode   = QSPI_SMSTR_DUAL_SPI;
        }
        else
        {
            tx_info.op_mode   = QSPI_SMSTR_QUAD_SPI;
        }

        ret_drv = R_QSPI_SMstr_Write(channel, &tx_info);
        if (QSPI_SMSTR_ERR_HARD == ret_drv)
        {
            return MEMDRV_ERR_HARD;
        }
        else if (QSPI_SMSTR_ERR_OTHER == ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }
        else
        {
            /* QSPI_SMSTR_SUCCESS */
        }

        tx_info.p_tx_data = (uint8_t *)(tx_info.p_tx_data + boundary_cnt);
        txcnt -= boundary_cnt;
    }

    /* Check the data count is multiple of 16.
       When the data count is multiple of 16,
       transfer the data using DMAC transfer. */
    if (0 != (txcnt & 0xfffffff0))
    {
        tx_info.data_cnt  = (txcnt & 0xfffffff0);   /* Set the data count to multiple of 16. */
        tx_info.tran_mode = r_memdrv_qspi_set_tran_mode(devno);
        if (MEMDRV_MODE_SINGLE == p_memdrv_info->io_mode)
        {
            tx_info.op_mode   = QSPI_SMSTR_SINGLE_SPI_WRITE;
        }
        else if (MEMDRV_MODE_DUAL == p_memdrv_info->io_mode)
        {
            tx_info.op_mode   = QSPI_SMSTR_DUAL_SPI;
        }
        else
        {
            tx_info.op_mode   = QSPI_SMSTR_QUAD_SPI;
        }
        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_qspi_enable_tx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_qspi_enable_tx_data_dtc(devno,
                                                    p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_qspi_enable_tx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_qspi_enable_tx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
            }
        }

        ret_drv = R_QSPI_SMstr_Write(channel, &tx_info);
        if (QSPI_SMSTR_ERR_HARD == ret_drv)
        {
            return MEMDRV_ERR_HARD;
        }
        else if (QSPI_SMSTR_ERR_OTHER == ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }
        else
        {
            /* QSPI_SMSTR_SUCCESS */
        }

        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_qspi_disable_tx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                   return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_qspi_disable_tx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_qspi_disable_tx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_qspi_disable_tx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
            }
        }
        tx_info.p_tx_data = (uint8_t *)(tx_info.p_tx_data + (txcnt & 0xfffffff0));
    }

