renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_memdrv_rx/src/r_memdrv_qspi.c
    /* Check the data count is multiple of 16.
       When the data count is not multiple of 16,
       transfer the data of 1-15 bytes using software transfer. */
    if (0 != (txcnt & 0x0000000f))
    {
        tx_info.data_cnt  = (txcnt & 0x0000000f);   /* Set data count to 1-15 bytes. */
        tx_info.tran_mode = QSPI_SMSTR_SW;
        if (MEMDRV_MODE_SINGLE == p_memdrv_info->io_mode)
        {
            tx_info.op_mode   = QSPI_SMSTR_SINGLE_SPI_WRITE;
        }
        else if (MEMDRV_MODE_DUAL == p_memdrv_info->io_mode)
        {
            tx_info.op_mode   = QSPI_SMSTR_DUAL_SPI;
        }
        else
        {
            tx_info.op_mode   = QSPI_SMSTR_QUAD_SPI;
        }

        ret_drv = R_QSPI_SMstr_Write(channel, &tx_info);
        if (QSPI_SMSTR_ERR_HARD == ret_drv)
        {
            return MEMDRV_ERR_HARD;
        }
        else if (QSPI_SMSTR_ERR_OTHER == ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }
        else
        {
            /* QSPI_SMSTR_SUCCESS */
        }
    }

    return MEMDRV_SUCCESS;
}
#endif
/************************************************************************************************
* Function Name: r_memdrv_qspi_rx
* Description  : Receives data for status register and Read ID.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                       ;   Successful operation
*              : MEMDRV_ERR_HARD                      ;   Hardware error
*              : MEMDRV_ERR_OTHER                     ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_qspi_rx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    qspi_smstr_info_t     rx_info;
    qspi_smstr_status_t   ret_drv = QSPI_SMSTR_SUCCESS;
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    
    rx_info.data_cnt  = p_memdrv_info->cnt;
    rx_info.p_rx_data = p_memdrv_info->p_data;
    rx_info.tran_mode = QSPI_SMSTR_SW;
    rx_info.op_mode   = QSPI_SMSTR_SINGLE_SPI_READ;

    ret_drv = R_QSPI_SMstr_Read(channel, &rx_info);
    if   (QSPI_SMSTR_SUCCESS == ret_drv)
    {
        return MEMDRV_SUCCESS;
    }
    else if (QSPI_SMSTR_ERR_HARD == ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_HARD;
    }
    else
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
} /* End of function r_memdrv_qspi_rx() */

/************************************************************************************************
* Function Name: r_memdrv_qspi_rx_data
* Description  : Receives data using the single mode.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                       ;   Successful operation
*              : MEMDRV_ERR_HARD                      ;   Hardware error
*              : MEMDRV_ERR_OTHER                     ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
#if (MEMDRV_CFG_DEV0_TYPE == 1)  | (MEMDRV_CFG_DEV1_TYPE == 1)
memdrv_err_t r_memdrv_qspi_rx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    qspi_smstr_info_t     rx_info;
    qspi_smstr_status_t   ret_drv = QSPI_SMSTR_SUCCESS;
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    
    rx_info.data_cnt  = p_memdrv_info->cnt;
    rx_info.p_rx_data = p_memdrv_info->p_data;

    /* Set transfer mode. */
    if (MEMDRV_ADDR_BOUNDARY & (uint32_t)p_memdrv_info->p_data)
    {
        /* If the buffer address is not 4 bytes alignment, force to perform the CPU transfer. */
        rx_info.tran_mode = QSPI_SMSTR_SW;
    }
    else if (MEMDRV_CHK_MULT_OF_16 & p_memdrv_info->cnt)
    {
        /* If the data counter is not multiple of 16, force to perform the CPU transfer. */
        rx_info.tran_mode = QSPI_SMSTR_SW;
    }
    else
    {
        rx_info.tran_mode = r_memdrv_qspi_set_tran_mode(devno);
    }

    switch (p_memdrv_info->io_mode)
    {
        case MEMDRV_MODE_SINGLE:
        {
            rx_info.op_mode = QSPI_SMSTR_SINGLE_SPI_READ;
        }
        break;
        case MEMDRV_MODE_DUAL:
        {
            rx_info.op_mode = QSPI_SMSTR_DUAL_SPI;
        }
        break;
        case MEMDRV_MODE_QUAD:
        {
            rx_info.op_mode = QSPI_SMSTR_QUAD_SPI;
        }
        break;
        default:
        break;
    }

    ret_drv = R_QSPI_SMstr_Read(channel, &rx_info);
    if   (QSPI_SMSTR_SUCCESS == ret_drv)
    {
        return MEMDRV_SUCCESS;
    }
    else if (QSPI_SMSTR_ERR_HARD == ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_HARD;
    }
    else
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

} /* End of function r_memdrv_qspi_rx_data() */
#elif (MEMDRV_CFG_DEV0_TYPE == 0)  | (MEMDRV_CFG_DEV1_TYPE == 0)
memdrv_err_t r_memdrv_qspi_rx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    qspi_smstr_info_t           rx_info;
    qspi_smstr_status_t         ret_drv      = QSPI_SMSTR_SUCCESS;
    uint32_t                    dummy_buffer = 0xffffffff;
    uint32_t                    boundary_cnt = 0;
    uint32_t                    rxcnt = p_memdrv_info->cnt;
    uint8_t channel = r_memdrv_get_drv_ch(devno);

    rx_info.p_tx_data = (uint8_t *)&dummy_buffer;
    rx_info.p_rx_data = p_memdrv_info->p_data;

