renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_memdrv_rx/src/r_memdrv_qspi.c
    /* Check the 4 bytes address boundary.
       When the address is not 4 bytes address boundary,
       transfer the data of 1-3 bytes using software transfer. */
    if (0 != ((uint32_t)rx_info.p_rx_data & 0x00000003))
    {
        boundary_cnt      = (0x00000004 - ((uint32_t)rx_info.p_rx_data & 0x00000003));
        rx_info.data_cnt  = boundary_cnt;
        rx_info.tran_mode = QSPI_SMSTR_SW;
        if (MEMDRV_MODE_SINGLE == p_memdrv_info->io_mode)
        {
            rx_info.op_mode   = QSPI_SMSTR_SINGLE_SPI_READ;
        }
        else if (MEMDRV_MODE_DUAL == p_memdrv_info->io_mode)
        {
            rx_info.op_mode   = QSPI_SMSTR_DUAL_SPI;
        }
        else
        {
            rx_info.op_mode   = QSPI_SMSTR_QUAD_SPI;
        }

        ret_drv = R_QSPI_SMstr_Read(channel, &rx_info);
        if (QSPI_SMSTR_ERR_HARD == ret_drv)
        {
            return MEMDRV_ERR_HARD;
        }
        else if (QSPI_SMSTR_ERR_OTHER == ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }
        else
        {
            /* QSPI_SMSTR_SUCCESS */
        }

        rx_info.p_rx_data = (uint8_t *)(rx_info.p_rx_data + boundary_cnt);
        rxcnt -= boundary_cnt;
    }

    /* Check the data count is multiple of 16.
       When the data count is multiple of 16,
       transfer the data using DMAC transfer. */
    if (0 != (rxcnt & 0xfffffff0))
    {
        rx_info.data_cnt  = (rxcnt & 0xfffffff0);   /* Set the data count to multiple of 16. */
        rx_info.tran_mode = r_memdrv_qspi_set_tran_mode(devno);
        if (MEMDRV_MODE_SINGLE == p_memdrv_info->io_mode)
        {
            rx_info.op_mode   = QSPI_SMSTR_SINGLE_SPI_READ;
        }
        else if (MEMDRV_MODE_DUAL == p_memdrv_info->io_mode)
        {
            rx_info.op_mode   = QSPI_SMSTR_DUAL_SPI;
        }
        else
        {
            rx_info.op_mode   = QSPI_SMSTR_QUAD_SPI;
        }

        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_qspi_enable_rx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_qspi_enable_rx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_qspi_enable_rx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_qspi_enable_rx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
            }
        }

        ret_drv = R_QSPI_SMstr_Read(channel, &rx_info);
        if (QSPI_SMSTR_ERR_HARD == ret_drv)
        {
            return MEMDRV_ERR_HARD;
        }
        else if (QSPI_SMSTR_ERR_OTHER == ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }
        else
        {
            /* QSPI_SMSTR_SUCCESS */
        }

        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_qspi_disable_rx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_qspi_disable_rx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_qspi_disable_rx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_qspi_disable_rx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
            }
        }


        rx_info.p_rx_data = (uint8_t *)(rx_info.p_rx_data + (rxcnt & 0xfffffff0));
    }

    /* Check the data count is multiple of 16.
       When the data count is not multiple of 16,
       transfer the data of 1-15 bytes using software transfer. */
    if (0 != (rxcnt & 0x0000000f))
    {
        rx_info.data_cnt  = (rxcnt & 0x0000000f);   /* Set data count to 1-15 bytes. */
        rx_info.tran_mode = QSPI_SMSTR_SW;
        if (MEMDRV_MODE_SINGLE == p_memdrv_info->io_mode)
        {
            rx_info.op_mode   = QSPI_SMSTR_SINGLE_SPI_READ;
        }
        else if (MEMDRV_MODE_DUAL == p_memdrv_info->io_mode)
        {
            rx_info.op_mode   = QSPI_SMSTR_DUAL_SPI;
        }
        else
        {
            rx_info.op_mode   = QSPI_SMSTR_QUAD_SPI;
        }

        ret_drv = R_QSPI_SMstr_Read(channel, &rx_info);
        if (QSPI_SMSTR_ERR_HARD == ret_drv)
        {
            return MEMDRV_ERR_HARD;
        }
        else if (QSPI_SMSTR_ERR_OTHER == ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }
        else
        {
            /* QSPI_SMSTR_SUCCESS */
        }
    }

    return MEMDRV_SUCCESS;
}
#endif

/************************************************************************************************
* Function Name: r_memdrv_qspi_set_tran_mode
* Description  : Sets transfer mode.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
* Return Value : QSPI_SMSTR_SW
*              : QSPI_SMSTR_DMAC
*              : QSPI_SMSTR_DTC
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static qspi_smstr_tranmode_t r_memdrv_qspi_set_tran_mode(uint8_t devno)
{
    qspi_smstr_tranmode_t mode = QSPI_SMSTR_SW;

