renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_memdrv_rx/src/r_memdrv_qspi.c
#if (MEMDRV_CFG_DEV0_INCLUDED == 1)
    if (MEMDRV_DEV0 == devno)
    {
        if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
        {
            mode = QSPI_SMSTR_DMAC;
        }
        else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
        {
            mode = QSPI_SMSTR_DTC;
        }
        else
        {
            mode = QSPI_SMSTR_SW;
        }
    }
#endif /* (MEMDRV_CFG_DEV0_INCLUDED == 1) */
#if (MEMDRV_CFG_DEV1_INCLUDED == 1)
    if (MEMDRV_DEV1 == devno)
    {
        if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
        {
            mode = QSPI_SMSTR_DMAC;
        }
        else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
        {
            mode = QSPI_SMSTR_DTC;
        }
        else
        {
            mode = QSPI_SMSTR_SW;
        }
    }
#endif /* (MEMDRV_CFG_DEV1_INCLUDED == 1) */

    return mode;
} /* End of function r_memdrv_qspi_set_tran_mode() */

/***********************************************************************************************************************
* Function Name: qspi_baud_cal
* Description  : Determines the QSPI channel SPBR register setting for the requested baud rate.
*                Returns the actual bit rate that the setting will achieve which may differ from requested.
*                If the requested bit rate cannot be exactly achieved, the next lower bit rate setting will be applied.
*                If successful, applies the calculated setting to the SPBR register.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
* Return Value :
* Note: Target baud must be >= PCLK/4 to get anything out.
* Limitations   : Does not track dynamically changing PCLK. Relies on constant BSP_PCLKB_HZ
***********************************************************************************************************************/
static uint8_t qspi_baud_cal(uint8_t devno)
{
    uint8_t bps_result;
    uint32_t bit_rate;
    uint32_t bit_rate_cal = 0;
    int32_t     f;                      // Frequency
    int32_t     n;                      // n term in equation
    int32_t     bit_div;                // N term in equation

    if (MEMDRV_DEV0 == devno)
    {
        bit_rate = (uint32_t)MEMDRV_CFG_DEV0_BR;
    }
    else if (MEMDRV_DEV1 == devno)
    {
        bit_rate = (uint32_t)MEMDRV_CFG_DEV1_BR;
    }
    else
    {

    }

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX66N) || \
    defined(BSP_MCU_RX72M) || defined(BSP_MCU_RX72N)
        f = BSP_PCLKB_HZ;
    #else
        f = BSP_PCLKA_HZ;
    #endif

    if ((f / bit_rate) < 2)
    {
        return 0;
    }
    
    bit_div = (uint32_t)((MEMDRV_TRNS_CMD & 0x00c0)>>2);
    
    n = ((f >> (bit_div + 1)) / (int32_t)bit_rate);
    if ((n > 0) && (n <= 0xff))
    {
        /* Now plug n back into the formula for BPS and check it. */
        bit_rate_cal = (uint32_t)(f / (2 *(n << bit_div)));

        if (bit_rate_cal > bit_rate)
        {
            n += 1;
            if (n > 0xff)
            {
                return 0; 
            }
        }
        bps_result = n;
    }
    else
    {
        return 0;
    }
    
    return bps_result;
} /* End of function qspi_baud_cal() */

#else
memdrv_err_t r_memdrv_qspi_open(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_open() */
memdrv_err_t r_memdrv_qspi_close(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_close() */
memdrv_err_t r_memdrv_qspi_disable(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_disable() */
memdrv_err_t r_memdrv_qspi_disable_tx_data(uint8_t devno,
                                           st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_disable_tx_data() */
memdrv_err_t r_memdrv_qspi_disable_rx_data(uint8_t devno,
                                           st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_disable_rx_data() */
memdrv_err_t r_memdrv_qspi_enable(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_enable() */
memdrv_err_t r_memdrv_qspi_enable_tx_data(uint8_t devno,
                                          st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_enable_tx_data() */
memdrv_err_t r_memdrv_qspi_enable_rx_data(uint8_t devno,
                                          st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_enable_rx_data() */
memdrv_err_t r_memdrv_qspi_tx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_tx() */
memdrv_err_t r_memdrv_qspi_tx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_tx_data() */
memdrv_err_t r_memdrv_qspi_rx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_rx() */
memdrv_err_t r_memdrv_qspi_rx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_qspi_rx_data() */

#endif  /* ((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR == MEMDRV_DRVR_RX_FIT_QSPI_SMSTR)) || \
           ((MEMDRV_CFG_DEV1_INCLUDED == 1) && (MEMDRV_CFG_DEV1_MODE_DRVR == MEMDRV_DRVR_RX_FIT_QSPI_SMSTR))
/* End of File */
